FoamProject/blockMeshVortexShedding/data-export-test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       198365;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       198465;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       198565;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       199565;
    }
    leadingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       200565;
    }
    trailingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       200575;
    }
    upperSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       200585;
    }
    lowerSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       200610;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          199500;
        startFace       200635;
    }
)

// ************************************************************************* //
