FoamProject/blockMeshVortexShedding/data-export-test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.5; 

purgeWrite      1000;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.8;

maxDi           0.7;

functions
{
    #includeFunc solverInfo;

    
    forceCoeffs_object
    {
	    // rhoInf - reference density
	    // CofR - Centre of rotation
	    // dragDir - Direction of drag coefficient
	    // liftDir - Direction of lift coefficient
	    // pitchAxis - Pitching moment axis
	    // magUinf - free stream velocity magnitude
	    // lRef - reference length
	    // Aref - reference area
	
      type forceCoeffs;
	    libs ("libforces.so");
	    
      patches
      (
        leadingEdge
        upperSurface
        lowerSurface
        trailingEdge
      );
	    
      pName p;
	    Uname U;
	    rho rhoInf;
	    rhoInf 1.0;     // incompressible

      // Reference pressure
      pRef 0;

    	//// Dump to file
	    log true;

	    CofR (0.0 0 0);
	    liftDir (0 1 0);
	    dragDir (1 0 0);
	    pitchAxis (0 0 1);
	    magUInf 1.4777;
	    lRef 1.0;         // reference lenght for moments
	    Aref 1.0;         // reference area 1 for 2d

      writeControl   adjustableRunTime;
      writeInterval  0.1;
    }
};

//OptimisationSwitches
//{
//	fileHandler collated;
//}

// ************************************************************************* //
